# HYPOTHESIS TESTING ASSIGNMENT- Question-2

## ----------------------------------------------------------------------------------------------------------------------------------

## (II) Lab TAT data :

### Statement - A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

###  Assumption : 

#### H0 be Null hypothesis where µ1 = µ2 .
#### H1 be Alternate hypothesis where µ1 ≠ µ2 .

### Hypothesis Formulation :

#### H0 : There is no significant difference in the average TAT of the sample collected from the 4 different laboratories.
#### Ha : There is a significant difference in the average TAT of the sample collected from the 4 different laboratories.

### Import Libraries :

In [1]:
import pandas as pd
import numpy as np

### Import dataset :

In [2]:
lab_tat_data = pd.read_csv('LabTAT.csv',sep=',')
lab_tat_data

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

### Initial Analysis :

In [3]:
lab_tat_data.shape

(120, 4)

In [4]:
lab_tat_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [5]:
lab_tat_data.isna().sum()

Laboratory 1    0
Laboratory 2    0
Laboratory 3    0
Laboratory 4    0
dtype: int64

In [6]:
lab_tat_data.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

### Statistic test :

####  We have to compare more than two groups at the same time we need to perform ANNOVA test on the data. And this test selected is one-way ANNOVA test as we are performing on one independent variable.

In [7]:
lab_tat_data.mean()

Laboratory 1    178.361583
Laboratory 2    178.902917
Laboratory 3    199.913250
Laboratory 4    163.682750
dtype: float64

In [8]:
from scipy import stats

In [9]:
# One-way ANNOVA test / ANNOVA ftest :
# Syntax - ** stats.f_oneway(column-1,column-2,column-3,column-4) **

print('One-way ANNOVA test')
print('-------------------------\n')
stats_value,pvalue=stats.f_oneway(lab_tat_data['Laboratory 1'],lab_tat_data['Laboratory 2'],lab_tat_data['Laboratory 3'],lab_tat_data['Laboratory 4'])
print('Statistical value :',stats_value)
print('P-value           :',pvalue)

One-way ANNOVA test
-------------------------

Statistical value : 118.70421654401437
P-value           : 2.1156708949992414e-57

### P-value check for hypothesis testing :

In [10]:
#level of significance is 5%, i.e. At 5% level of significance do we reject or do not reject ?

if pvalue < 0.05:
    print('We can reject the null hypothesis and claim that there is significant difference in the average TAT (Turn Around Time) of the sample collected from the 4 different laboratories.')
else:
    print('We do not reject the null hypothesis and claim that there is no significant difference in the average TAT (Turn Around Time) of the sample collected from the 4 different laboratories.')

We can reject the null hypothesis and claim that there is significant difference in the average TAT (Turn Around Time) of the sample collected from the 4 different laboratories.